Tekla.Structures.Dialog.FilteredListBox.FilteredItemComparer.Compare(System.String,System.String)
Compares two string instances and returns a value indicating whether one is less than,
equal to, or greater than the other.
A string equal to the constructor's selectedItem parameter is considered to be less than
anything else. The strings that start with the constructor's filter parameter will be next
and they are followed by the strings that contain (but do not start with) the filter parameter.
The strings that do not contain filter parameter will be last.
Each group is internally sorted with string.Sort(x, y, StringComparison.InvariantCultureIgnoreCase).
All comparisons are case-insensitive.
x: The first string instance to compare.
y: The second string instance to compare.
Returns:
Less than zero if x is less than y. Zero if x equals y. Greater than zero if x is greater than y.